<?php
// 以下をfor文を使用して表示してください。
// ヒント: forの中でforを３回使用

// ********1
// *******121
// ******12321
// *****1234321
// ****123454321
// ***12345654321
// **1234567654321
// *123456787654321
// 12345678987654321

$num = 9;
for($i = 1 ; $i <= $num ; $i++){


    for($j = $num-1 ; $j > $i-1; $j--)//1行の中で*の表示ﾙｰﾌﾟ
    {
        echo "*";
    }

    for($k = 1 ; $k < $i ; $k++)//1行の中でk行分数字を表示
    {
        echo $k;
    }


        if($i == 1) 
        {
            echo $i;
            $add  = $i;
        }
        else
        {
            echo $i . $add;
            $add = $i . $add;
        }
    
    echo "<br />";
}